glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F30x_DFP.pdsc
        <!-- *************************  Device 'GD32F303RI'  ***************************** -->
        <device Dname="GD32F303RI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303RK'  ***************************** -->
        <device Dname="GD32F303RK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303VC'  ***************************** -->
        <device Dname="GD32F303VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x0C000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_HD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_HD"/>
          <debug svd="SVD/GD32F30x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303VE'  ***************************** -->
        <device Dname="GD32F303VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_HD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_HD"/>
          <debug svd="SVD/GD32F30x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303VG'  ***************************** -->
        <device Dname="GD32F303VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303VI'  ***************************** -->
        <device Dname="GD32F303VI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303VK'  ***************************** -->
        <device Dname="GD32F303VK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303ZC'  ***************************** -->
        <device Dname="GD32F303ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x0C000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_HD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_HD"/>
          <debug svd="SVD/GD32F30x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303ZE'  ***************************** -->
        <device Dname="GD32F303ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_HD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_HD"/>
          <debug svd="SVD/GD32F30x_HD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303ZG'  ***************************** -->
        <device Dname="GD32F303ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303ZI'  ***************************** -->
        <device Dname="GD32F303ZI">
          <memory    id="IROM1"                   start="0x08000000" size="0x0200000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

        <!-- *************************  Device 'GD32F303ZK'  ***************************** -->
        <device Dname="GD32F303ZK">
          <memory    id="IROM1"                   start="0x08000000" size="0x0300000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_XD.FLM" start="0x08000000" size="0x010000" default="1"/>
          <compile header="Device/Include/gd32f30x.h" define="GD32F30X_XD"/>
          <debug svd="SVD/GD32F30x_XD.svd"/>
        </device>

      </subFamily>

<!-- ************************  Subfamily 'GD32F305'  **************************** -->
      <subFamily DsubFamily="GD32F305">
        <processor Dclock="120000000"/>
         <compile header="Device/Include/gd32f30x.h" define="GD32F30X_CL"/>
        <debug svd="SVD/GD32F30x_CL.svd"/>
        <description>
        GD32F305 - ARM Cortex-M4 Core
          Frequency up to 120 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 128 KB to 3072 KB
          SRAM size is 96 KB with HW parity checking
          18 KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F305RB'  ***************************** -->
        <device Dname="GD32F305RB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305RC  ***************************** -->
        <device Dname="GD32F305RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305RE  ***************************** -->
        <device Dname="GD32F305RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305RG  ***************************** -->
        <device Dname="GD32F305RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305VC  ***************************** -->
        <device Dname="GD32F305VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305VE  ***************************** -->
        <device Dname="GD32F305VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305VG  ***************************** -->
        <device Dname="GD32F305VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>


