glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F30x_DFP.pdsc
        <!-- *************************  Device 'GD32F305ZC  ***************************** -->
        <device Dname="GD32F305ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305ZE  ***************************** -->
        <device Dname="GD32F305ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F305ZG  ***************************** -->
        <device Dname="GD32F305ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

      </subFamily>

<!-- ************************  Subfamily 'GD32F307'  **************************** -->
      <subFamily DsubFamily="GD32F307">
        <processor Dclock="120000000"/>
         <compile header="Device/Include/gd32f30x.h" define="GD32F30X_CL"/>
        <debug svd="SVD/GD32F30x_CL.svd"/>
        <description>
        GD32F307 - ARM Cortex-M4 Core
          Frequency up to 120 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256 KB to 3072 KB
          SRAM size is 96 KB with HW parity checking
          18 KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F307RC  ***************************** -->
        <device Dname="GD32F307RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307RE  ***************************** -->
        <device Dname="GD32F307RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307RG  ***************************** -->
        <device Dname="GD32F307RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307VC  ***************************** -->
        <device Dname="GD32F307VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307VE  ***************************** -->
        <device Dname="GD32F307VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307VG  ***************************** -->
        <device Dname="GD32F307VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>


        <!-- *************************  Device 'GD32F307ZC  ***************************** -->
        <device Dname="GD32F307ZC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307ZE  ***************************** -->
        <device Dname="GD32F307ZE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F307ZG  ***************************** -->
        <device Dname="GD32F307ZG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x018000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F30x_CL.FLM" start="0x08000000" size="0x010000" default="1"/>
        </device>

      </subFamily>
    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>
 

    <!-- Device Conditions -->
    <condition id="GD32F30xHD">
      <description>GigaDevice GD32F30x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F303*[CE]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F30xXD">
      <description>GigaDevice GD32F30x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F303*[GIK]"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device Conditions -->
    <condition id="GD32F30xCL">
      <description>GigaDevice GD32F30x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F30[57]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

   <!-- Device + CMSIS Conditions -->
    <condition id="GD32F30x CMSIS">
      <description>GigaDevice GD32F30x Devices and CMSIS-CORE</description>
      <accept condition="GD32F30xHD"/>
      <accept condition="GD32F30xXD"/>
      <accept condition="GD32F30xCL"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="GD32F30x_libopt"/>    
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="RCU"/>           
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="PMU"/>    
    </condition>
    <!-- GD32F30x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F30x STDPERIPHERALS RCU">
      <description>GigaDevice  GD32F30x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F30x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="RCU"/>
    </condition>

     <!-- GD32F30x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F30x STDPERIPHERALS MISC">
      <description>GigaDevice  GD32F30x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F30x CMSIS"/>
      <require Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="MISC"/>
    </condition>

