glcloud/keil_v5/ARM/PACK/.Web/GigaDevice.GD32F30x_DFP.pdsc
  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="TIMER" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
        </RTE_Components_h>
        <files>
          <!-- TIMER flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_timer.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_timer.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="USART" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
        </RTE_Components_h>
        <files>
          <!-- USART flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_usart.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_usart.c" attr="config" version="1.0.2" />
        </files>
    </component>

  <component Cclass="Device" Cgroup="GD32F30x_StdPeripherals" Csub="WWDGT" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F30x Devices</description>
        <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
        </RTE_Components_h>
        <files>
          <!-- WWDGT flie -->
          <file category="header" name="Device/Firmware/Peripherals/inc/gd32f30x_wwdgt.h" />
          <file category="source" name="Device/Firmware/Peripherals/src/gd32f30x_wwdgt.c" attr="config" version="1.0.2" />
        </files>
    </component>

    <!-- Utilities GD32F30x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F30x" Cversion="1.0.2" condition="GD32F30x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f30x_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f30x_eval.c" attr="config" version="1.0.2"/>
      </files>
    </component>

    <!-- Config GD32F30x -->
    <component Cclass="Device" Cgroup="GD32F30x_libopt" Cversion="1.0.2" condition="GD32F30x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32f30x_libopt.h"/>
      </files>
    </component>

   <!-- Startup GD32F30x HD -->
    <component Cclass="Device" Cgroup="Startup"  Cversion="1.0.2" condition="GD32F30xHD">
      <description>System Startup for GigaDevice GD32F303 High Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f30x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f30x_hd.s" attr="config" version="1.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f30x.c"      attr="config" version="1.0.2"/>
      </files>
    </component>

   <!-- Startup GD32F30x XD -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.2" condition="GD32F30xXD">
      <description>System Startup for GigaDevice GD32F303 Extra Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f30x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f30x_xd.s" attr="config" version="1.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f30x.c"      attr="config" version="1.0.2"/>

      </files>
    </component>

   <!-- Startup GD32F30x CL -->
    <component Cclass="Device" Cgroup="Startup"   Cversion="1.0.2" condition="GD32F30xCL">
      <description>System Startup for GigaDevice GD32F305 and GD32F307 Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/"/>
        <file category="header" name="Device/Include/gd32f30x.h"/>
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f30x_cl.s" attr="config" version="1.0.2" condition="Compiler ARMCC"/>
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f30x.c"      attr="config" version="1.0.2"/>
      </files>
    </component>
  </components>

</package>
